reedy/ESP32-RevK/lwmqtt.c
// Send (return is non null error message if failed)
const char *
lwmqtt_send_full (lwmqtt_t handle, int tlen, const char *topic, int plen, const unsigned char *payload, char retain)
{
   const char *ret = NULL;
   if (!handle)
      ret = "No handle";
   else
   {
      if (tlen < 0)
         tlen = strlen (topic ? : "");
      if (plen < 0)
         plen = strlen ((char *) payload ? : "");
      int mlen = 2 + tlen + plen;
      if (mlen >= 128 * 128)
         ret = "Too big";
      else
      {
         if (mlen >= 128)
            mlen++;             // two byte len
         mlen += 2;             // header and one byte len
         unsigned char *buf = mallocspi (mlen);
         if (!buf)
            ret = "Malloc";
         else
         {
            if (!xSemaphoreTake (handle->mutex, portMAX_DELAY))
               ret = "Failed to get lock";
            else
            {
               if (handle->sock < 0)
                  ret = "Not connected";
               else
               {
                  unsigned char *p = buf;
                  *p++ = 0x30 + (retain ? 1 : 0);       // message
                  if (mlen > 129)
                  {             // Two byte len
                     *p++ = (((mlen - 3) & 0x7F) | 0x80);
                     *p++ = ((mlen - 3) >> 7);
                  } else
                     *p++ = mlen - 2;   // 1 byte len
                  *p++ = tlen >> 8;
                  *p++ = tlen;
                  if (tlen)
                     memcpy (p, topic, tlen);
                  p += tlen;
                  if (plen && payload)
                     memcpy (p, payload, plen);
                  p += plen;
                  assert ((p - buf) == mlen);
                  if (hwrite (handle, buf, mlen) < mlen)
                     ret = "Failed to send";
               }
               xSemaphoreGive (handle->mutex);
            }
            freez (buf);
         }
      }
   }
   if (ret)
      ESP_LOGD (TAG, "Send: %s", ret);
   return ret;
}

static void
lwmqtt_loop (lwmqtt_t handle)
{
   // Handle rx messages
   unsigned char *buf = 0;
   int buflen = 0;
   int pos = 0;
   uint32_t kacheck = uptime () + 60;   // Response time check
   uint32_t ka = uptime () + (handle->server ? 5 : handle->keepalive);  // Server does not know KA initially
   while (handle->running && !handle->close)
   {                            // Loop handling messages received, and timeouts
      int need = 0;
      if (pos < 2)
         need = 2;
      else if (!(buf[1] & 0x80))
         need = 2 + buf[1];     // One byte len
      else if (pos < 3)
         need = 3;
      else if (!(buf[2] & 0x80))
         need = 3 + (buf[2] << 7) + (buf[1] & 0x7F);    // Two byte len
      else
      {
         ESP_LOGE (TAG, "Silly len %02X %02X %02X", buf[0], buf[1], buf[2]);
         break;
      }
      if (pos < need)
      {
         uint32_t now = uptime ();
         if (now >= ka)
         {
            if (handle->server)
               break;           // timeout
            // client, so send ping - do so regularly regardless as we want pingresp regularly to detect down as a client.
            uint8_t b[] = { 0xC0, 0x00 };       // Ping
            xSemaphoreTake (handle->mutex, portMAX_DELAY);
            hwrite (handle, b, sizeof (b));
            xSemaphoreGive (handle->mutex);
            ka = uptime () + handle->keepalive; // Client KA next
            kacheck = uptime () + 10;   // Expect KA resp
         } else if (kacheck && kacheck < uptime ())
         {                      // only set for client anyway
            ESP_LOGE (TAG, "KA fail");
            break;
         }
         if (!handle->tls || esp_tls_get_bytes_avail (handle->tls) <= 0)
         {                      // Wait for data to arrive
            fd_set r,
              e;
            FD_ZERO (&r);
            FD_SET (handle->sock, &r);
            FD_ZERO (&e);
            FD_SET (handle->sock, &e);
            struct timeval to = { 1, 0 };       // Keeps us checking running but is light load at once a second
            int sel = select (handle->sock + 1, &r, NULL, &e, &to);
            if (sel < 0)
            {
               ESP_LOGE (TAG, "Select failed");
               break;
            }
            if (FD_ISSET (handle->sock, &e))
            {
               ESP_LOGE (TAG, "Closed");
               break;
            }
            if (!FD_ISSET (handle->sock, &r))
               continue;        // Nothing waiting
         }
         if (need > buflen)
         {                      // Make sure we have enough space
            buf = realloc (buf, (buflen = need) + 1);   // One more to allow extra null on end in all cases
            if (!buf)
            {
               ESP_LOGE (TAG, "realloc fail %d", need);
               break;
            }
         }
         int got = hread (handle, buf + pos, need - pos);
         if (got <= 0)
         {
            ESP_LOGI (TAG, "Connection closed");
            break;              // Error or close
         }
         pos += got;
         continue;
      }
      kacheck = 0;              // We got something (does not have to be pingresp)
      if (handle->server)
         ka = uptime () + handle->keepalive * 3 / 2;    // timeout for client resent on message received
      unsigned char *p = buf + 1,
         *e = buf + pos;
      while (p < e && (*p & 0x80))
         p++;
      p++;
#ifdef CONFIG_REVK_MQTT_SERVER
      if (handle->server && !handle->connected && (*buf >> 4) != 1)
         break;                 // Expect login as first message
#endif
      switch (*buf >> 4)
      {
      case 1:
#ifdef CONFIG_REVK_MQTT_SERVER
         if (!handle->server)
            break;
         handle->connected = 1;
         ESP_LOGI (TAG, "Connected incoming %d", handle->port);
         // TODO incoming connect
         handle->keepalive = 10;        // TODO get from message
         uint8_t b[4] = { 0x20 };       // conn ack
         xSemaphoreTake (handle->mutex, portMAX_DELAY);
         hwrite (handle, b, sizeof (b));
         xSemaphoreGive (handle->mutex);
#endif
         break;
      case 2:                  // conack
         if (handle->server)
            break;
         if (p[1])
         {                      // Failed
            ESP_LOGI (TAG, "Connect failed %s:%d code %d", handle->hostname, handle->port, p[1]);
            handle->failed = (p[1] > 7 ? 7 : p[1]);
         } else
         {
            ESP_LOGI (TAG, "Connect ack  %s:%d", handle->hostname, handle->port);
            handle->failed = 0;
            handle->backoff = 0;
            handle->connected = 1;
            handle->connecttime = uptime ();
            if (handle->callback)
               handle->callback (handle->arg, NULL, strlen (handle->hostname), (void *) handle->hostname);
         }
         break;
      case 3:                  // pub
         {                      // Topic
            int tlen = (p[0] << 8) + p[1];
            p += 2;
            char *topic = (char *) p;
            p += tlen;
            unsigned short id = 0;
            if (*buf & 0x06)
            {
               id = (p[0] << 8) + p[1];
               p += 2;
            }
            if (p > e)
            {
               ESP_LOGE (TAG, "Bad msg");
               break;
            }
            if (*buf & 0x06)
            {                   // reply
               uint8_t b[4] = { (*buf & 0x4) ? 0x50 : 0x40, 2, id >> 8, id };
               xSemaphoreTake (handle->mutex, portMAX_DELAY);
               hwrite (handle, b, sizeof (b));
               xSemaphoreGive (handle->mutex);
            }
            int plen = e - p;
            if (handle->callback)
            {
               if (plen && !(*buf & 0x06))
               {                // Move back a byte for null termination to be added without hitting payload
                  memmove (topic - 1, topic, tlen);
                  topic--;
               }
               topic[tlen] = 0;
               p[plen] = 0;
               handle->callback (handle->arg, topic, plen, p);
            }
         }
         break;
      case 4:                  // puback - no action as we don't use non QoS 0
         break;
      case 5:                  // pubrec - not expected as we don't use non QoS 0
         if (handle->server)
            break;
         {
            uint8_t b[4] = { 0x60, p[0], p[1] };
            xSemaphoreTake (handle->mutex, portMAX_DELAY);
            hwrite (handle, b, sizeof (b));
            xSemaphoreGive (handle->mutex);
         }
         break;
      case 6:                  // pubcomp - no action as we don't use non QoS 0
         break;
      case 8:                  // sub
#ifdef CONFIG_REVK_MQTT_SERVER
         if (!handle->server)
            break;
         // TODO
#endif
         break;
      case 9:                  // suback - no action
         break;
      case 10:                 // unsub - no action
         break;
      case 11:                 // unsuback - ok
         if (handle->server)
            break;
         break;
      case 12:                 // ping (no action as resets ka anyway)
         break;
      case 13:                 // pingresp
         break;
#ifdef CONFIG_REVK_MQTT_SERVER
      case 14:                 // disconnect
         ESP_LOGE (TAG, "Client disconnected");
         break;
#endif
      default:
         ESP_LOGE (TAG, "Unknown MQTT %02X (%d)", *buf, pos);
      }
      pos = 0;
   }
   handle->connected = 0;
   freez (buf);
   if (!handle->server && (handle->close || !handle->running))
   {                            // Close connection - as was clean
      ESP_LOGE (TAG, "Closed cleanly");
      uint8_t b[] = { 0xE0, 0x00 };     // Disconnect cleanly
      xSemaphoreTake (handle->mutex, portMAX_DELAY);
      hwrite (handle, b, sizeof (b));
      xSemaphoreGive (handle->mutex);
   }
   handle_close (handle);
   handle->close = 0;
   if (handle->callback)
      handle->callback (handle->arg, NULL, 0, NULL);
}

static void
client_task (void *pvParameters)
{
   lwmqtt_t handle = pvParameters;
   if (!handle)
   {
      vTaskDelete (NULL);
      return;
   }
   handle->backoff = 0;
   while (handle->running)
   {                            // Loop connecting and trying repeatedly
      handle->sock = -1;
      char *hostname = strdup (handle->hostname);
      uint16_t port = handle->port;
      {                         // Port suffix
         char *p = hostname + strlen (hostname);
         while (p > hostname && p[-1] >= '0' && p[-1] <= '9')
            p--;
         if (p > hostname && *p > '0' && *p <= '9' && p[-1] == ':')
         {
            port = atoi (p);
            *--p = 0;
         }
      }
      // Connect
      ESP_LOGI (TAG, "Connecting %s:%d", hostname, port);
      // Can connect using TLS or non TLS with just sock set instead
      if (revk_has_ip ())
      {
         if (handle->ca_cert_bytes || handle->crt_bundle_attach)
         {
            esp_tls_t *tls = NULL;
            esp_tls_cfg_t cfg = {
               .cacert_buf = handle->ca_cert_buf,
               .cacert_bytes = handle->ca_cert_bytes,
               .common_name = handle->tlsname,
               .clientcert_buf = handle->our_cert_buf,
               .clientcert_bytes = handle->our_cert_bytes,
               .clientkey_buf = handle->our_key_buf,
               .clientkey_bytes = handle->our_key_bytes,
               .crt_bundle_attach = handle->crt_bundle_attach,
            };
            tls = esp_tls_init ();
            if (esp_tls_conn_new_sync (hostname, strlen (hostname), port, &cfg, tls) != 1)
               free (tls);
            else
            {
               handle->tls = tls;
               esp_tls_get_conn_sockfd (handle->tls, &handle->sock);
            }
         } else
         {                      // Non TLS
            char sport[6];
            snprintf (sport, sizeof (sport), "%d", port);
            int tryconnect (uint8_t ip6)
            {
               if (handle->sock >= 0)
                  return 1;     // connected already
             struct addrinfo base = { ai_family: ip6 ? AF_INET6 : AF_UNSPEC, ai_socktype:SOCK_STREAM };
               struct addrinfo *a = 0,
                  *p = NULL;
               if (!getaddrinfo (hostname, sport, &base, &a) && a)
               {
                  for (p = a; p && !handle->dnsipv6; p = p->ai_next)
                     if (p->ai_family == AF_INET6)
                        handle->dnsipv6 = 1;
                  for (p = a; p; p = p->ai_next)
                  {
                     if (p->ai_family == AF_INET && (ip6 || !revk_has_ipv4 ()))
                        continue;
                     if (p->ai_family == AF_INET6 && !revk_has_ipv6 ())
                        continue;
                     handle->sock = socket (p->ai_family, p->ai_socktype, p->ai_protocol);
                     if (handle->sock < 0)
                        continue;
                     if (p->ai_family == AF_INET6)
                     {
                        handle->ipv6 = 1;       // Is IPv6
                        handle->close = 0;
                     }
                     //ESP_LOGE (TAG, "Try %s:%d%s", hostname, port, handle->ipv6 ? " (IPv6)" : handle->dnsipv6 ? " (Not IPv6)" : "");
                     //ESP_LOG_BUFFER_HEX_LEVEL (TAG, p->ai_addr, p->ai_addrlen, ESP_LOG_ERROR);
                     if (connect (handle->sock, p->ai_addr, p->ai_addrlen))
                     {
                        close (handle->sock);
                        handle->sock = -1;
                        handle->ipv6 = 0;
                        continue;
                     }
                     // Connected
                     break;
                  }
               }
               if (a)
                  freeaddrinfo (a);
               if (handle->sock < 0)
                  return 0;     // Not  connected
               return 1;        // Worked
            }
            tryconnect (1);     // Explicit try IPv6 first
            tryconnect (0);
         }
      }
      if (handle->backoff < 10)
         handle->backoff++;     // 100 seconds max
      if (!revk_has_ip ())
         handle->backoff = 0;   // We did not try even
      else if (handle->sock < 0)
      {                         // Failed before we even start
         ESP_LOGI (TAG, "Could not connect to %s:%d", hostname, port);
         if (handle->callback)
            handle->callback (handle->arg, NULL, 0, NULL);
      } else
      {
         ESP_LOGE (TAG, "Connected %s:%d%s", hostname, port, handle->ipv6 ? " (IPv6)" : handle->dnsipv6 ? " (Not IPv6)" : "");
         hwrite (handle, handle->connect, handle->connectlen);
         lwmqtt_loop (handle);
         handle->dnsipv6 = 0;
         handle->ipv6 = 0;
      }
      free (hostname);
      // On ESP32 uint32_t, returned by this func, appears to be long, while on ESP8266 it's a pure unsigned int
      // The easiest and least ugly way to get around is to cast to long explicitly
      ESP_LOGI (TAG, "Retry %d (mem:%ld)", handle->backoff, (long) esp_get_free_heap_size ());
      usleep (100000LL << handle->backoff);
   }
   handle_free (handle);
   vTaskDelete (NULL);
}

#ifdef	CONFIG_REVK_MQTT_SERVER
static void
server_task (void *pvParameters)
{
   lwmqtt_t handle = pvParameters;
   lwmqtt_loop (handle);
   handle_free (handle);
   vTaskDelete (NULL);
}

static void
listen_task (void *pvParameters)
{
   lwmqtt_t handle = pvParameters;
   if (handle)
   {
      struct sockaddr_in dst = {        // Yep IPv4 local
         .sin_addr.s_addr = htonl (INADDR_ANY),
         .sin_family = AF_INET,
         .sin_port = htons (handle->port),
      };
      int sock = socket (AF_INET, SOCK_STREAM, IPPROTO_IP);
      if (sock >= 0)
      {
         if (bind (sock, (void *) &dst, sizeof (dst)) < 0 || listen (sock, 1) < 0)
            close (sock);
         else
         {
            ESP_LOGD (TAG, "Listening for MQTT on %d", handle->port);
            while (handle->running)
            {                   // Loop connecting and trying repeatedly
               struct sockaddr_in addr;
               socklen_t addrlen = sizeof (addr);
               int s = accept (sock, (void *) &addr, &addrlen);
               if (s < 0)
                  break;
               ESP_LOGD (TAG, "Connect on MQTT %d", handle->port);
               lwmqtt_t h = mallocspi (sizeof (*h));
               if (!h)
                  break;
               memset (h, 0, sizeof (*h));
               h->port = handle->port;  // Only for debugging
               h->callback = handle->callback;
               h->arg = h;
               h->mutex = xSemaphoreCreateBinary ();
               h->server = 1;
               h->sock = s;
               h->running = 1;
               if (handle->ca_cert_bytes)
               {                // TLS
#ifdef CONFIG_ESP_TLS_SERVER
                  esp_tls_cfg_server_t cfg = {
                     .cacert_buf = handle->ca_cert_buf,
                     .cacert_bytes = handle->ca_cert_bytes,
                     .servercert_buf = handle->our_cert_buf,
                     .servercert_bytes = handle->our_cert_bytes,
                     .serverkey_buf = handle->our_key_buf,
                     .serverkey_bytes = handle->our_key_bytes,
                  };
                  h->tls = esp_tls_init ();
                  esp_err_t e = 0;
                  if (!h->tls || (e = esp_tls_server_session_create (&cfg, s, h->tls)))
                  {
                     ESP_LOGE (TAG, "TLS server failed %s", h->tls ? esp_err_to_name (e) : "No TLS");
                     h->running = 0;
                  } else
                  {             // Check client name? Do login callback
                     // TODO server client name check
                  }
#else
                  ESP_LOGE (TAG, "Not built for TLS server");
                  h->running = 0;
#endif
               }
               if (h->running)
               {
                  TaskHandle_t task_id = NULL;
                  xTaskCreate (server_task, "mqtt-server", 5 * 1024, (void *) h, 2, &task_id);
               } else
               {                // Close
                  ESP_LOGI (TAG, "MQTT aborted");
#ifdef CONFIG_ESP_TLS_SERVER
                  if (h->tls)
                     esp_tls_server_session_delete (h->tls);
#endif
                  close (h->sock);
               }

            }
         }
      }
      handle_free (handle);
   }
   vTaskDelete (NULL);
}
#endif

// Simple send - non retained no wait topic ends on space then payload
const char *
lwmqtt_send_str (lwmqtt_t handle, const char *msg)
{
   if (!handle || !*msg)
      return NULL;
   const char *p;
   for (p = msg; *p && *p != '\t'; p++);
   if (!*p)
      for (p = msg; *p && *p != ' '; p++);
   int tlen = p - msg;
   if (*p)
      p++;
   return lwmqtt_send_full (handle, tlen, msg, strlen (p), (void *) p, 0);
}

uint32_t
lwmqtt_connected (lwmqtt_t handle)
{                               // Confirm connected (and for how long)
   if (!handle || !handle->connected)
      return 0;
   return (uptime () - handle->connecttime) ? : 1;
}

int
lwmqtt_failed (lwmqtt_t handle)
{                               // Confirm failed
   if (!handle)
      return 255;               // non existent
   if (handle->connected)
      return 0;                 // Actually connected
   if (handle->failed)
      return -handle->failed;   // failed
   return handle->backoff;      // Trying
}
